# Напишите программу, которая приветствует пользователя, выводя слово Hello,
# введенное имя и восклицательный знак (например: 'Hello, Harry!').
# Программа должна считывать в строковую переменную значение и писать соответствующее приветствие.
# Обратите внимание, что после запятой должен обязательно стоять пробел, а перед восклицательным знаком пробела нет.
# Операцией конкатенации строк (+) пользоваться нельзя.

print('Введите ваше Имя')
Name = input()
print('Здравствуйте, ' + Name + '!')