# Дано число N. Нужно вычислить 2ᴺ.

print('Введите трехзначное число')
x = str(input())
# извлечение символов строки
b = int(x[0])
c = int(x[1])
d = int(x[2])
print(b + c + d)