# Дано трехзначное число. Найдите сумму его цифр.

a = int(input())
b = int(input())
print(a**b)
print(pow(a, b,))